Repository: Serg-zefir/vscode-ua-translate
Catalog: for_translation_vscode-editor_vs_platform_*.xlf
Languages: uk

# requirearray
source: menu items must be an array
uk: елементи меню повинні бути масивом

# requirestring
source: property `{0}` is mandatory and must be of type `string`
uk: властивість "{0}" є обов'язковою і повинна мати тип `string`

# optstring
source: property `{0}` can be omitted or must be of type `string`
uk: властивість "{0}" може бути опущена або ж повинна мати тип `string`

# vscode.extension.contributes.menuItem.command
source: Identifier of the command to execute. The command must be declared in the 'commands'-section
uk: Ідентифікатор команди, яку потрібно виконати. Ця команда мусить бути оголошена в розділі commands

# vscode.extension.contributes.menuItem.alt
source: Identifier of an alternative command to execute. The command must be declared in the 'commands'-section
uk: Ідентифікатор альтернитивної команди, яку потрібно виконати. Ця команда мусить бути оголошена в розділі commands

# vscode.extension.contributes.menuItem.when
source: Condition which must be true to show this item
uk: Умова, яка мусить мати значення True, щоб відображався цей елемент

# vscode.extension.contributes.menuItem.group
source: Group into which this command belongs
uk: Група до котрої ця команда належить

# vscode.extension.contributes.menus
source: Contributes menu items to the editor
uk: Додає елементи меню в редактора

# menus.commandPalette
source: The Command Palette
uk: Палітра команд

# menus.touchBar
source: The touch bar (macOS only)
uk: Панель дотику (лише для macOS)

# menus.editorTitle
source: The editor title menu
uk: Головне меню редактора

# menus.editorContext
source: The editor context menu
uk: Контекстне меню редактора

# menus.explorerContext
source: The file explorer context menu
uk: Контекстне меню оглядача файлів

# menus.editorTabContext
source: The editor tabs context menu
uk: Контекстне меню вкладок редактора

# menus.debugCallstackContext
source: The debug callstack context menu
uk: Контекстне меню стеку викликів при налагодженні

# menus.scmTitle
source: The Source Control title menu
uk: Головне меню системи контролю версій

# menus.scmSourceControl
source: The Source Control menu
uk: Меню "Система контролю версій"

# menus.resourceGroupContext
source: The Source Control resource group context menu
uk: Контекстне меню групи ресурсів для системи контролю версій

# menus.resourceStateContext
source: The Source Control resource state context menu
uk: Контекстне меню стану ресурсів для системи контролю версій

# view.viewTitle
source: The contributed view title menu
uk: Меню заголовку для вікна учасників

# view.itemContext
source: The contributed view item context menu
uk: Контекстне меню елементу для вікна учасників

# nonempty
source: expected non-empty value.
uk: очікується НЕпорожнє значення.

# opticon
source: property `icon` can be omitted or must be either a string or a literal like `{dark, light}`
uk: властивість 'icon' може бути опущена або мусить бути 'рядком' або літералом, наприклад "{dark, light}"

# requireStringOrObject
source: property `{0}` is mandatory and must be of type `string` or `object`
uk: властивість "{0}" обов'язкова і повинна мати тип "string" або "object"

# requirestrings
source: properties `{0}` and `{1}` are mandatory and must be of type `string`
uk: властивості "{0}" і "{1}" обов'язкові та мусять мати тип "string"

# vscode.extension.contributes.commandType.command
source: Identifier of the command to execute
uk: Ідентифікатор виконуваної команди

# vscode.extension.contributes.commandType.title
source: Title by which the command is represented in the UI
uk: Назва команди в інтерфейсі користувача

# vscode.extension.contributes.commandType.category
source: (Optional) Category string by the command is grouped in the UI
uk: (Необов'язково) Рядок категорій, по яким команди групуються в інтерфейсі користувача

# vscode.extension.contributes.commandType.icon
source: (Optional) Icon which is used to represent the command in the UI. Either a file path or a themable configuration
uk: (Необов'язково) Значок, який використовується для представлення команди в інтерфейсі користувача. Це шлях до файлу або конфігурація з можливістю застосування тем

# vscode.extension.contributes.commandType.icon.light
source: Icon path when a light theme is used
uk: Шлях до значка, якщо використовується світла тема

# vscode.extension.contributes.commandType.icon.dark
source: Icon path when a dark theme is used
uk: Шлях до значка, якщо використовується темна тема

# vscode.extension.contributes.commands
source: Contributes commands to the command palette.
uk: Додає команди в палітру команд.

# dup
source: Command `{0}` appears multiple times in the `commands` section.
uk: Команда "{0}" зустрічається кілька разів у розділі commands.

# menuId.invalid
source: `{0}` is not a valid menu identifier
uk: "{0}" не є припустимим ідентифікатором меню

# missing.command
source: Menu item references a command `{0}` which is not defined in the 'commands' section.
uk: Елемент меню посилається на команду "{0}", яка не визначена в розділі commands.

# missing.altCommand
source: Menu item references an alt-command `{0}` which is not defined in the 'commands' section.
uk: Елемент меню посилається на альтернативну команду "{0}", яка не визначена в розділі commands.

# dupe.command
source: Menu item references the same command as default and alt-command
uk: Елемент меню посилається на одну і ту ж команду як команду за замовчуванням та альтернативну команду

# nosupport.altCommand
source: Sorry, but currently only the 'navigation' group of the 'editor/title' menu supports alt-commands
uk: Зараз лише группа navigation меню editor/title підтримує альтернативні команди

# gotoValidation
source: Arguments in `--goto` mode should be in the format of `FILE(:LINE(:CHARACTER))`.
uk: Аргументи в режимі "--goto" повинні бути в форматі "ФАЙЛ(:РЯДОК(:СИМВОЛ))".

# diff
source: Compare two files with each other.
uk: Порівняння двох файлів між собою.

# add
source: Add folder(s) to the last active window.
uk: Додавання папок до останнього активного вікна.

# goto
source: Open a file at the path on the specified line and character position.
uk: Відкриття файла по заданому шляху з виділенням вказаного символа у вказаному рядкові.

# locale
source: The locale to use (e.g. en-US or zh-TW).
uk: Мовний стандарт, який варто використовувати (наприклад, en-US або zh-TW).

# newWindow
source: Force a new instance of Code.
uk: Примусово запустити новий екземпляр Code.

# performance
source: Start with the 'Developer: Startup Performance' command enabled.
uk: Запустити з включеною командою "Developer: Startup Performance".

# prof-startup
source: Run CPU profiler during startup
uk: Запустити профайлер ЦП при запуску

# inspect-extensions
source: Allow debugging and profiling of extensions. Check the developer tools for the connection uri.
uk: Дозволити відладку та профілювання додатків. Перевірте URI підключення для інструментів розробника

# inspect-brk-extensions
source: Allow debugging and profiling of extensions with the extension host being paused after start. Check the developer tools for the connection uri.
uk: Дозволити відладку та профілювання додатків, коли вузол додатку призупинений після запуску. Перевірте URI підключення для інструментів розробника

# reuseWindow
source: Force opening a file or folder in the last active window.
uk: Примусово відкрити файл або папку в останньому активному вікні.

# userDataDir
source: Specifies the directory that user data is kept in, useful when running as root.
uk: Визначає папку, в якій зберігаються дані користувачів, використовується у випадку виконання під назви привілейованого користувача.

# log
source: Log level to use. Default is 'info'. Allowed values are 'critical', 'error', 'warn', 'info', 'debug', 'trace', 'off'.
uk: Використовуваний рівень ведення журналу. Значення за замовчуванням — "info". Допустимі значення: "critical", "error", "warn", "info", "debug", "trace", "off".

# verbose
source: Print verbose output (implies --wait).
uk: Друк докладного виводу (мається на увазі використання параметру "--wait").

# wait
source: Wait for the files to be closed before returning.
uk: Чекати закриття файлів перед поверненням.

# extensionHomePath
source: Set the root path for extensions.
uk: Встановіть основний шлях для додатків.

# listExtensions
source: List the installed extensions.
uk: Вивести встановлені додатки.

# showVersions
source: Show versions of installed extensions, when using --list-extension.
uk: Показати версії встановлених додатків коли доданий параметр --list-extension.

# installExtension
source: Installs an extension.
uk: Встановлює додаток.

# uninstallExtension
source: Uninstalls an extension.
uk: Видаляє додаток.

# experimentalApis
source: Enables proposed api features for an extension.
uk: Включає запропоновані функції API для додатку.

# disableExtensions
source: Disable all installed extensions.
uk: Виключити всі встановлені додатки.

# disableGPU
source: Disable GPU hardware acceleration.
uk: Виключити апаратне прискорення GPU.

# status
source: Print process usage and diagnostics information.
uk: Друк відомостей про використання процесу і діагностичну інформацію.

# version
source: Print version.
uk: Друк версії.

# help
source: Print usage.
uk: Друк інформації про використання.

source: Usage
uk: Використання

source: options
uk: параметри

source: paths
uk: шляхи

# stdinWindows
source: To read output from another program, append '-' (e.g. 'echo Hello World | {0} -')
uk: Щоб прочитати вивід з іншої програми, додайте '-' (ось так 'echo Hello World | {0} -')

# stdinUnix
source: To read from stdin, append '-' (e.g. 'ps aux | grep code | {0} -')
uk: Щоб прочитати з 'stdin', додайте '-' (наприклад, 'ps aux | grep code | {0} -')

# optionsUpperCase
source: Options
uk: Параметри

# proxy
source: The proxy setting to use. If not set will be taken from the http_proxy and https_proxy environment variables
uk: Використовуваний параметр проксі. Якщо він не заданий, то буде взятий з змінних середовища http_proxy і https_proxy.

# strictSSL
source: Whether the proxy server certificate should be verified against the list of supplied CAs.
uk: Чи повинен сертифікат проксі-сервера перевірятися за списком наданих ЦС.

# proxyAuthorization
source: The value to send as the 'Proxy-Authorization' header for every network request.
uk: Значення, що відправляється як заголовок "Proxy-Authorization" для кожного мережевого запиту.

source: New Window
uk: Нове вікно

# newWindowDesc
source: Opens a new window
uk: Відкриває нове вікно

# recentFolders
source: Recent Workspaces
uk: Недавні робочі області

source: Code Workspace
uk: Робоча область кода

source: Untitled (Workspace)
uk: (Робоча область) без назви

# workspaceNameVerbose
source: {0} (Workspace)
uk: {0} (робоча область)

# workspaceName
source: {0} (Workspace)
uk: {0} (робоча область)

source: Extensions
uk: Додатки

source: Preferences
uk: Параметри

# invalidManifest
source: Extension invalid: package.json is not a JSON file.
uk: Неприпустимий додаток: package.json не є файлом JSON.

# restartCode
source: Please restart Code before reinstalling {0}.
uk: Будь ласка, перезавантажте Code перед повторним встановленням {0}.

# installingOutdatedExtension
source: A newer version of this extension is already installed. Would you like to override this with the older version?
uk: Уже встановлена більш новіша версія цього додатку. Ви хочете перезаписати її старішою версією?

source: Override
uk: Перезаписати

source: Cancel
uk: Відміна

# notFoundCompatible
source: Unable to install '{0}'; there is no available version compatible with VS Code '{1}'.
uk: Неможливо встановити '{0}'; немає доступної версії, сумісної з VS Code-ом '{1}'.

# notFoundCompatibleDependency
source: Unable to install because, the depending extension '{0}' compatible with current version '{1}' of VS Code is not found.
uk: Не вдається виконати установку, так як не знайдено залежний додаток '{0}', сумісний з поточною версією VS Code '{1}'.

# quitCode
source: Unable to install the extension. Please Quit and Start VS Code before reinstalling.
uk: Неможливо встановити додаток. Будь ласка, закрийте і запустіть VS Code перед повторним встановленням.

# uninstallDependeciesConfirmation
source: Would you like to uninstall '{0}' only or its dependencies also?
uk: Ви хочете видалити "{0}" окремо або разом із залежностями?

# uninstallOnly
source: Only
uk: Лише

# uninstallAll
source: All
uk: Все

# uninstallConfirmation
source: Are you sure you want to uninstall '{0}'?
uk: Ви дійсно хочете видалити "{0}"?

source: OK
uk: ОК

# singleDependentError
source: Cannot uninstall extension '{0}'. Extension '{1}' depends on this.
uk: Не вдається видалити додаток "{0}". Від нього залежить додаток "{1}".

# twoDependentsError
source: Cannot uninstall extension '{0}'. Extensions '{1}' and '{2}' depend on this.
uk: Не вдається видалити додаток "{0}". Від нього залежать додатки "{1}" і "{2}".

# multipleDependentsError
source: Cannot uninstall extension '{0}'. Extensions '{1}', '{2}' and others depend on this.
uk: Не вдається видалити додаток "{0}". Від нього залежать додатки "{1}", "{2}" та інші.

# notExists
source: Could not find extension
uk: Не вдалося знайти додаток

# notCompatibleDownload
source: Unable to download because the extension compatible with current version '{0}' of VS Code is not found.
uk: Не вдається виконати завантаження, так як не знайдено додаток, сумісний з поточною версією VS Code '{0}'.

# telemetryConfigurationTitle
source: Telemetry
uk: Телеметрія

# telemetry.enableTelemetry
source: Enable usage data and errors to be sent to Microsoft.
uk: Дозволити відправку свідчень про використання й помилки в корпорацію Майкрософт.

source: Close
uk: Закрити

source: Later
uk: Пізніше

# vscode.extension.engines.vscode
source: For VS Code extensions, specifies the VS Code version that the extension is compatible with. Cannot be *. For example: ^0.10.5 indicates compatibility with a minimum VS Code version of 0.10.5.
uk: Для додатків VS Code вказує версию VS Code, з якою сумісний додаток. Вона не може бути задана як "*". Наприклад, ^0.10.5 повідомляє про сумісність з мінімальною версією VS Code 0.10.5.

# vscode.extension.publisher
source: The publisher of the VS Code extension.
uk: Видавець додатку VS Code.

# vscode.extension.displayName
source: The display name for the extension used in the VS Code gallery.
uk: Відображається ім'я додатку, яке використовується у галереї VS Code.

# vscode.extension.categories
source: The categories used by the VS Code gallery to categorize the extension.
uk: Категорії, що використовуються галереєю VS Code для класифікації додатку.

# vscode.extension.galleryBanner
source: Banner used in the VS Code marketplace.
uk: Банер, що використовується в магазині VS Code.

# vscode.extension.galleryBanner.color
source: The banner color on the VS Code marketplace page header.
uk: Колір банера в заголовці сторінки магазину VS Code.

# vscode.extension.galleryBanner.theme
source: The color theme for the font used in the banner.
uk: Кольорова тема для шрифта, що використовується у банері.

# vscode.extension.contributes
source: All contributions of the VS Code extension represented by this package.
uk: Всі публикації додатку VS Code, представлені цим пакетом.

# vscode.extension.preview
source: Sets the extension to be flagged as a Preview in the Marketplace.
uk: Додає мітку "Попередня версія" для додатку в Marketplace.

# vscode.extension.activationEvents
source: Activation events for the VS Code extension.
uk: Події активації для додатку VS Code.

# vscode.extension.activationEvents.onLanguage
source: An activation event emitted whenever a file that resolves to the specified language gets opened.
uk: Подія активації випускається кожного разу, коли відкривається файл, який вирішує задану мову.

# vscode.extension.activationEvents.onCommand
source: An activation event emitted whenever the specified command gets invoked.
uk: Подія активації видається кожен раз при виклику зазначеної команди.

# vscode.extension.activationEvents.onDebug
source: An activation event emitted whenever a user is about to start debugging or about to setup debug configurations.
uk: Подія активації видається кожен раз, коли користувач запускає відладку або збирається встановити конфигурацію відладки.

# vscode.extension.activationEvents.onDebugInitialConfigurations
source: An activation event emitted whenever a "launch.json" needs to be created (and all provideDebugConfigurations methods need to be called).
uk: Подія активації видається кожен раз, коли необхідно створити файл "launch.json" (і викликати всі методи provideDebugConfigurations).

# vscode.extension.activationEvents.onDebugResolve
source: An activation event emitted whenever a debug session with the specific type is about to be launched (and a corresponding resolveDebugConfiguration method needs to be called).
uk: Подія активації видається кожен раз при запуску сеансу відладки вказаного типу (і при виклику відповідного методу resolveDebugConfiguration).

# vscode.extension.activationEvents.workspaceContains
source: An activation event emitted whenever a folder is opened that contains at least a file matching the specified glob pattern.
uk: Подія активації видається кожен раз при відкритті папки, яка містить принаймні один файл, який відповідає зазначеній стандартній масці.

# vscode.extension.activationEvents.onView
source: An activation event emitted whenever the specified view is expanded.
uk: Подія активації видається кожен раз при розгортанні вказаного вікна.

# vscode.extension.activationEvents.star
source: An activation event emitted on VS Code startup. To ensure a great end user experience, please use this activation event in your extension only when no other activation events combination works in your use-case.
uk: Подія активації видається при запуску VS Code. Для зручності користувача використовуйте цю подію в своєму додатку лише в том випадку, якщо інші поєднання подій не підходять.

# vscode.extension.badges
source: Array of badges to display in the sidebar of the Marketplace's extension page.
uk: Масив емблем, на боковій панелі сторінки додатку Marketplace.

# vscode.extension.badges.url
source: Badge image URL.
uk: URL-адрес зображення емблеми.

# vscode.extension.badges.href
source: Badge link.
uk: Посилання на емблему.

# vscode.extension.badges.description
source: Badge description.
uk: Опис емблеми.

# vscode.extension.extensionDependencies
source: Dependencies to other extensions. The identifier of an extension is always ${publisher}.${name}. For example: vscode.csharp.
uk: Залежності від інших додатків. Ідентифікатор додатку — завжди ${publisher}.${name}. Наприклад: vscode.csharp.

# vscode.extension.scripts.prepublish
source: Script executed before the package is published as a VS Code extension.
uk: Скрипт, що виконується перед публікацією пакета в якості додатку VS Code.

# vscode.extension.icon
source: The path to a 128x128 pixel icon.
uk: Шлях до значка розміром 128 x 128 пікселів.

# defaultConfigurations.title
source: Default Configuration Overrides
uk: Перевизначення конфигурації за замовчуванням

# overrideSettings.description
source: Configure editor settings to be overridden for {0} language.
uk: Налаштування обумовлених параметрів редактору для мови {0}.

# overrideSettings.defaultDescription
source: Configure editor settings to be overridden for a language.
uk: Налаштування параметрів редактору, обумовлених для мови.

# config.property.languageDefault
source: Cannot register '{0}'. This matches property pattern '\\[.*\\]$' for describing language specific editor settings. Use 'configurationDefaults' contribution.
uk: Неможливо зареєструвати "{0}". Це відповідає шаблону властивості '\\[.*\\]$' для опису параметрів редактору, визначених мовою. Використовуйте вкладку configurationDefaults.

# config.property.duplicate
source: Cannot register '{0}'. This property is already registered.
uk: Неможливо зареєструвати "{0}". Це властивість уже зареєстрована.

# schema.colors
source: Colors used in the workbench.
uk: Кольори, що використовуються на робочому місці.

# foreground
source: Overall foreground color. This color is only used if not overridden by a component.
uk: Загальний колір переднього плану. Цей колір використовується, лише якщо його не перевизначить компонент.

# errorForeground
source: Overall foreground color for error messages. This color is only used if not overridden by a component.
uk: Загальний колір переднього плану для повідомлень про помилки. Цей колір використовується лише якщо його не перевизначить компонент.

# descriptionForeground
source: Foreground color for description text providing additional information, for example for a label.
uk: Колір тексту елементу, що містить пояснення, наприклад, для мітки.

# focusBorder
source: Overall border color for focused elements. This color is only used if not overridden by a component.
uk: Загальний колір рамки для елементів з фокусом. Цей колір використовується лише в том випадку, якщо не перевизначений в компоненті.

# contrastBorder
source: An extra border around elements to separate them from others for greater contrast.
uk: Додаткова рамка навколо елементів, яка відділяє їх від інших елементів для поліпшення контрасту.

# activeContrastBorder
source: An extra border around active elements to separate them from others for greater contrast.
uk: Додаткова рамка навколо активних елементів, яка відділяє їх від інших елементів для поліпшення контрасту.

# selectionBackground
source: The background color of text selections in the workbench (e.g. for input fields or text areas). Note that this does not apply to selections within the editor.
uk: Колір фону виділеного тексту в робочій області (наприклад, в полях вводу або в текстових полях). Не застосовується до виділеного тексту в редакторі.

# textSeparatorForeground
source: Color for text separators.
uk: Колір для розділювачів тексту.

# textLinkForeground
source: Foreground color for links in text.
uk: Колір переднього плану для посилань в тексті.

# textLinkActiveForeground
source: Foreground color for active links in text.
uk: Колір переднего фону для активних посилань в тексті.

# textPreformatForeground
source: Foreground color for preformatted text segments.
uk: Колір тексту фіксованого формату.

# textBlockQuoteBackground
source: Background color for block quotes in text.
uk: Колір фону для блоків з цитатами в тексті.

# textBlockQuoteBorder
source: Border color for block quotes in text.
uk: Колір рамки для блоків з цитатами в тексті.

# textCodeBlockBackground
source: Background color for code blocks in text.
uk: Колір фону для програмного коду в тексті.

# widgetShadow
source: Shadow color of widgets such as find/replace inside the editor.
uk: Колір тіні віджетів редактору, таких як "Знайти/замінити".

source: Input box background.
uk: Фон поля вводу.

source: Input box foreground.
uk: Передній план поля вводу.

source: Input box border.
uk: Рамка поля вводу.

# inputBoxActiveOptionBorder
source: Border color of activated options in input fields.
uk: Колір рамки активованих параметрів в полях вводу.

# inputPlaceholderForeground
source: Input box foreground color for placeholder text.
uk: Колір фону заповнювачу тексту в елементі вводу.

# inputValidationInfoBackground
source: Input validation background color for information severity.
uk: Фоновий колір перевірки вводу для рівня важливості "Інформування".

# inputValidationInfoBorder
source: Input validation border color for information severity.
uk: Колір рамки перевірки вводу для рівня важливості "Інформування".

# inputValidationWarningBackground
source: Input validation background color for information warning.
uk: Фоновий колір перевірки вводу для рівня важливості "Попередження".
