Repository: Serg-zefir/vscode-ua-translate
Catalog: for_translation_vscode-editor_vs_platform_*.xlf
Languages: uk

# contributes.defaults.light
source: The default color for light themes. Either a color value in hex (#RRGGBB[AA]) or the identifier of a themable color which provides the default.
uk: Колір за замовчуванням для світлих тем. Вкажіть значення кольору в шіснадцятковому форматі (#RRGGBB[AA]) або індентифікатор кольору теми.

# contributes.defaults.dark
source: The default color for dark themes. Either a color value in hex (#RRGGBB[AA]) or the identifier of a themable color which provides the default.
uk: Колір за замовчуванням для темних тем. Вкажіть значення кольору в шіснадцятковому форматі (#RRGGBB[AA]) або індентифікатор кольору теми.

# contributes.defaults.highContrast
source: The default color for high contrast themes. Either a color value in hex (#RRGGBB[AA]) or the identifier of a themable color which provides the default.
uk: Колір за замовчуванням для тем з високим контрастом. Вкажіть значення кольору в шіснадцятковому форматі (#RRGGBB[AA]) або індентифікатор кольору теми.

# invalid.colorConfiguration
source: 'configuration.colors' must be a array
uk: 'configuration.colors' мусить бути масивом

# invalid.default.colorType
source: {0} must be either a color value in hex (#RRGGBB[AA] or #RGB[A]) or the identifier of a themable color which provides the default.
uk: {0} мусить являти собою значення кольору в шіснадцятковому форматі (#RRGGBB[AA] або #RGB[A]) або індентифікатор кольору теми.

# invalid.id
source: 'configuration.colors.id' must be defined and can not be empty
uk: Параметр 'configuration.colors.id' мусить бути вказаний і не може бути порожнім

# invalid.id.format
source: 'configuration.colors.id' must follow the word[.word]*
uk: Параметр 'configuration.colors.id' мусить слідувати за word[.word]*

# invalid.description
source: 'configuration.colors.description' must be defined and can not be empty
uk: Параметр 'configuration.colors.description' мусить бути вказаний і не може бути порожнім

# invalid.defaults
source: 'configuration.colors.defaults' must be defined and must contain 'light', 'dark' and 'highContrast'
uk: 'configuration.colors.defaults' може бути вказаний і може містити значення 'light', 'dark' і 'highContrast'

# versionSyntax
source: Could not parse `engines.vscode` value {0}. Please use, for example: ^0.10.0, ^1.2.3, ^0.11.0, ^0.10.x, etc.
uk: Не вдалося проаналізувати значення engines.vscode {0}. Використовуйте, наприклад, ^0.10.0, ^1.2.3, ^0.11.0, ^0.10.x і т. д.

# versionSpecificity1
source: Version specified in `engines.vscode` ({0}) is not specific enough. For vscode versions before 1.0.0, please define at a minimum the major and minor desired version. E.g. ^0.10.0, 0.10.x, 0.11.0, etc.
uk: Версія, вказана у engines.vscode ({0}), недостатньо конкретна. Для версій vscode до 1.0.0 вкажіть хоча б основний і додатковий номер версії. Наприклад, 0.10.0, 0.10.x, 0.11.0 і т.д.

# versionSpecificity2
source: Version specified in `engines.vscode` ({0}) is not specific enough. For vscode versions after 1.0.0, please define at a minimum the major desired version. E.g. ^1.10.0, 1.10.x, 1.x.x, 2.x.x, etc.
uk: Версія, вказана у engines.vscode ({0}), недостатньо конкретна. Для версій vscode після 1.0.0 вкажіть хоча б основний номер версії. Наприклад, 1.10.0, 1.10.x, 1.x.x, 2.x.x і т.д.

# versionMismatch
source: Extension is not compatible with Code {0}. Extension requires: {1}.
uk: Додаток несумісний з Code "{0}". Додаток потребує: {1}.

# extensionDescription.empty
source: Got empty extension description
uk: Порожній опис додатку

# extensionDescription.publisher
source: property `{0}` is mandatory and must be of type `string`
uk: властивість "{0}" є обов'язковою і повинно мати тип string

# extensionDescription.name
source: property `{0}` is mandatory and must be of type `string`
uk: властивість "{0}" є обов'язковою і повинно мати тип string

# extensionDescription.version
source: property `{0}` is mandatory and must be of type `string`
uk: властивість "{0}" є обов'язковою і повинно мати тип string

# extensionDescription.engines
source: property `{0}` is mandatory and must be of type `object`
uk: властивість "{0}" є обов'язковою і мусить бути типу object

# extensionDescription.engines.vscode
source: property `{0}` is mandatory and must be of type `string`
uk: властивість "{0}" є обов'язковою і повинно мати тип string

# extensionDescription.extensionDependencies
source: property `{0}` can be omitted or must be of type `string[]`
uk: властивість "{0}" може бути опущено або мусить бути типу "string []"

# extensionDescription.activationEvents1
source: property `{0}` can be omitted or must be of type `string[]`
uk: властивість "{0}" може бути опущено або мусить бути типу "string []"

# extensionDescription.activationEvents2
source: properties `{0}` and `{1}` must both be specified or must both be omitted
uk: обидві властивості, "{0}" і "{1}", повинні бути чи вказані, чи опущені

# extensionDescription.main1
source: property `{0}` can be omitted or must be of type `string`
uk: властивість "{0}" може бути опущено або повинно мати тип string

# extensionDescription.main2
source: Expected `main` ({0}) to be included inside extension's folder ({1}). This might make the extension non-portable.
uk: Очікується, що функція main ({0}) буде включена в папку додатку ({1}). Через це додаток не можна буде перенести.

# extensionDescription.main3
source: properties `{0}` and `{1}` must both be specified or must both be omitted
uk: обидві властивості, "{0}" і "{1}", повинні бути чи вказані, чи опущені

# notSemver
source: Extension version is not semver compatible.
uk: Версія додатку несумісна з semver.

# first.chord
source: ({0}) was pressed. Waiting for second key of chord...
uk: Була натиснута клавіша ({0}). Очікування натиснення другої клавіші комбінації...

# missing.chord
source: The key combination ({0}, {1}) is not a command.
uk: Комбінація клавіш ({0}та{1}) не є командою.

# integrity.ok
source: OK
uk: ОК

# integrity.dontShowAgain
source: Don't show again
uk: Більше не показувати

# integrity.moreInfo
source: More information
uk: Більше відомостей

# integrity.prompt
source: Your {0} installation appears to be corrupt. Please reinstall.
uk: Схоже, ваша встановлення {0} пошкоджене. Спробуйте знову інсталювати.

source: No workspace.
uk: Немає робочої області.
