Repository: Serg-zefir/vscode-ua-translate
Catalog: for_translation_vscode-editor_vs_platform_*.xlf
Languages: uk

# inputValidationWarningBorder
source: Input validation border color for warning severity.
uk: Колір рамки перевірки вводу для рівня важливості "Попередження".

# inputValidationErrorBackground
source: Input validation background color for error severity.
uk: Фоновий колір перевірки вводу для рівня важливості "Помилка".

# inputValidationErrorBorder
source: Input validation border color for error severity.
uk: Колір рамки перевірки вводу для рівня важливості "Помилка".

source: Dropdown background.
uk: Фон Випадаючого меню.

source: Dropdown foreground.
uk: Передній план Випадаючого меню.

source: Dropdown border.
uk: Рамка Випадаючого меню.

# listFocusBackground
source: List/Tree background color for the focused item when the list/tree is active. An active list/tree has keyboard focus, an inactive does not.
uk: Фоновий колір елементу в фокусі List/Tree, коли елемент List/Tree активний. На активному елементі List/Tree є фокус клавіатури, на неактивному — ні.

# listFocusForeground
source: List/Tree foreground color for the focused item when the list/tree is active. An active list/tree has keyboard focus, an inactive does not.
uk: Колір переднього плану елементу в фокусі List/Tree, коли елемент List/Tree активний. На активному елементі List/Tree є фокус клавіатури, на неактивному — ні.

# listActiveSelectionBackground
source: List/Tree background color for the selected item when the list/tree is active. An active list/tree has keyboard focus, an inactive does not.
uk: Фоновий колір вибраного елементу List/Tree, коли елемент List/Tree активний. На активному елементі List/Tree є фокус клавіатури, на неактивному — ні.

# listActiveSelectionForeground
source: List/Tree foreground color for the selected item when the list/tree is active. An active list/tree has keyboard focus, an inactive does not.
uk: Колір переднього плану вибраного елементу List/Tree, коли елемент List/Tree активний. На активному елементі List/Tree є фокус клавіатури, на неактивному — ні.

# listInactiveSelectionBackground
source: List/Tree background color for the selected item when the list/tree is inactive. An active list/tree has keyboard focus, an inactive does not.
uk: Фоновий колір вибраного елементу List/Tree, коли елемент List/Tree неактивний. На активному елементі List/Tree є фокус клавіатури, на неактивному — ні.

# listInactiveSelectionForeground
source: List/Tree foreground color for the selected item when the list/tree is inactive. An active list/tree has keyboard focus, an inactive does not.
uk: Колір тексту вибраного елементу List/Tree, коли елемент List/Tree неактивний. На активному елементі List/Tree є фокус клавіатури, на неактивному — ні.

# listHoverBackground
source: List/Tree background when hovering over items using the mouse.
uk: Фоновий колір елементів List/Tree при наведені курсору мишки.

# listHoverForeground
source: List/Tree foreground when hovering over items using the mouse.
uk: Колір переднього плану елементів List/Tree при наведені курсору мишки.

# listDropBackground
source: List/Tree drag and drop background when moving items around using the mouse.
uk: Фоновий колір елементів List/Tree при переміщені мишкою.

# highlight
source: List/Tree foreground color of the match highlights when searching inside the list/tree.
uk: Колір переднього плану для виділення відповідності при пошуку по елементу List/Tree.

# invalidItemForeground
source: List/Tree foreground color for invalid items, for example an unresolved root in explorer.
uk: Колір переднього плану списку/дерева для неприпустимих елементів, наприклад, для нерозкритого корневого вузла в провіднику.

# pickerGroupForeground
source: Quick picker color for grouping labels.
uk: Засоби швидкого вибору кольору для групування міток.

# pickerGroupBorder
source: Quick picker color for grouping borders.
uk: Засоби швидкого вибору кольору для групування рамок.

# buttonForeground
source: Button foreground color.
uk: Колір переднього плану кнопки.

# buttonBackground
source: Button background color.
uk: Колір фону кнопки.

# buttonHoverBackground
source: Button background color when hovering.
uk: Колір фону кнопки при наведені.

# badgeBackground
source: Badge background color. Badges are small information labels, e.g. for search results count.
uk: Колір фону бэджа. Бэджи - небольшие информационные елементи, отображающие количество, наприклад, результатів пошуку.

# badgeForeground
source: Badge foreground color. Badges are small information labels, e.g. for search results count.
uk: Колір тексту бэджа. Бэджи - небольшие информационные елементи, отображающие количество, наприклад, результатів пошуку.

# scrollbarShadow
source: Scrollbar shadow to indicate that the view is scrolled.
uk: Колір тіні полосы прокрутки, яка свидетельствует про том, що содержимое прокручивается.

# scrollbarSliderBackground
source: Scrollbar slider background color.
uk: Колір фону ползунка полосы прокрутки.

# scrollbarSliderHoverBackground
source: Scrollbar slider background color when hovering.
uk: Колір фону ползунка полосы прокрутки при наведені курсору.

# scrollbarSliderActiveBackground
source: Scrollbar slider background color when active.
uk: Колір фону активного ползунка полосы прокрутки.

# progressBarBackground
source: Background color of the progress bar that can show for long running operations.
uk: Колір фону индикатора виконання, який может отображаться для длительных операций.

# editorBackground
source: Editor background color.
uk: Колір фону редактора.

# editorForeground
source: Editor default foreground color.
uk: Колір переднього плану редактора за замовчуванням.

# editorWidgetBackground
source: Background color of editor widgets, such as find/replace.
uk: Колір фону виджетов редактора, таких як найти/заменить.

# editorWidgetBorder
source: Border color of editor widgets. The color is only used if the widget chooses to have a border and if the color is not overridden by a widget.
uk: Колір рамкиы віджетів редактора. Цей колір використовується лише в том випадку, якщо у міні-приложения є рамка і якщо цей колір не переопределен міні-приложением.

# editorSelectionBackground
source: Color of the editor selection.
uk: Колір виділення редактора.

# editorSelectionForeground
source: Color of the selected text for high contrast.
uk: Колір виділеного тексту в режимі высокого контрасту.

# editorInactiveSelection
source: Color of the selection in an inactive editor.
uk: Колір виділення в неактивному редакторе.

# editorSelectionHighlight
source: Color for regions with the same content as the selection.
uk: Колір регионов з тем же содержимым, що і в выделении.

# editorFindMatch
source: Color of the current search match.
uk: Колір поточного пошуку совпадений.

# findMatchHighlight
source: Color of the other search matches.
uk: Колір інших совпадений пошуку.

# findRangeHighlight
source: Color the range limiting the search.
uk: Колір диапазона, ограничивающего поиск.

# hoverHighlight
source: Highlight below the word for which a hover is shown.
uk: Виделение под словом, для которого показано наведение.

# hoverBackground
source: Background color of the editor hover.
uk: Колір фону при наведені вказівника на редактор.

# hoverBorder
source: Border color of the editor hover.
uk: Колір рамки при наведені вказівника на редактор.

# activeLinkForeground
source: Color of active links.
uk: Колір активних посилань.

# diffEditorInserted
source: Background color for text that got inserted.
uk: Колір фону для добавлених рядків.

# diffEditorRemoved
source: Background color for text that got removed.
uk: Колір фону для видалених рядків.

# diffEditorInsertedOutline
source: Outline color for the text that got inserted.
uk: Колір контуру для добавлених рядків.

# diffEditorRemovedOutline
source: Outline color for text that got removed.
uk: Колір контуру для видалених рядків.

# mergeCurrentHeaderBackground
source: Current header background in inline merge-conflicts.
uk: Колір фону поточного заголовку у внутрішніх конфліктах злиття.

# mergeCurrentContentBackground
source: Current content background in inline merge-conflicts.
uk: Колір фону поточного вмісту у внутрішніх конфліктах злиття.

# mergeIncomingHeaderBackground
source: Incoming header background in inline merge-conflicts.
uk: Колір фону вхідного заголовку у внутрішніх конфліктах злиття.

# mergeIncomingContentBackground
source: Incoming content background in inline merge-conflicts.
uk: Колір фону вхідного вмісту у внутрішніх конфліктах злиття.

# mergeCommonHeaderBackground
source: Common ancestor header background in inline merge-conflicts.
uk: Колір фону заголовку для загального предка у внутрішніх конфліктах злиття.

# mergeCommonContentBackground
source: Common ancester content background in inline merge-conflicts.
uk: Колір фону вмісту для загального предка у внутрішніх конфліктах злиття.

# mergeBorder
source: Border color on headers and the splitter in inline merge-conflicts.
uk: Колір рамки заголовків і розділювачів у внутрішніх конфліктах злиття.

# overviewRulerCurrentContentForeground
source: Current overview ruler foreground for inline merge-conflicts.
uk: Колір переднього плану лінійки поточного вікна у внутрішніх конфліктах злиття.

# overviewRulerIncomingContentForeground
source: Incoming overview ruler foreground for inline merge-conflicts.
uk: Колір переднього плану лінійки вхідного вікна у внутрішніх конфліктах злиття.

# overviewRulerCommonContentForeground
source: Common ancestor overview ruler foreground for inline merge-conflicts.
uk: Колір переднього плану для обзорної лінійки для загального предка у внутрішніх конфліктах злиття.

# overviewRulerFindMatchForeground
source: Overview ruler marker color for find matches.
uk: Колір мітки лінійки в вікні спостереження для результатів пошуку.

# overviewRulerSelectionHighlightForeground
source: Overview ruler marker color for selection highlights.
uk: Колір мітки лінійки в вікні спостереження для виділення.

# ProblemPatternParser.loopProperty.notLast
source: The loop property is only supported on the last line matcher.
uk: Властивість циклу підтримується лише на останньому списку.

# ProblemPatternParser.problemPattern.missingRegExp
source: The problem pattern is missing a regular expression.
uk: В шаблоні проблем відсутній регулярний вираз.

# ProblemPatternParser.problemPattern.missingProperty
source: The problem pattern is invalid. It must have at least a file, message and line or location match group.
uk: Шаблон проблеми недійсний. Вона повинна мати, принаймні, групу відповідей файлів, повідомлень, рядків або місцеположень.

# ProblemPatternParser.invalidRegexp
source: Error: The string {0} is not a valid regular expression.
uk: Помилка: рядок {0} не є припустимим регулярним виразом.

# ProblemPatternSchema.regexp
source: The regular expression to find an error, warning or info in the output.
uk: Регулярний вираз для пошуку помилки, попередження або інформації на виході.

# ProblemPatternSchema.file
source: The match group index of the filename. If omitted 1 is used.
uk: Індекс групи співставлення для назви файла. Якщо він не вказаний, використовується значення 1.

# ProblemPatternSchema.location
source: The match group index of the problem's location. Valid location patterns are: (line), (line,column) and (startLine,startColumn,endLine,endColumn). If omitted (line,column) is assumed.
uk: Індекс групи співставлення для розташування проблеми. Допустимі шаблони розташування: (рядок), (рядок,стовпець) і (початковий_рядок,початковий_стовпець,кінцевий_рядок,кінцевий_стовпець). Якщо індекс не вказаний, передбачається шаблон (рядок,стовпець).

# ProblemPatternSchema.line
source: The match group index of the problem's line. Defaults to 2
uk: Індекс групи співставлення для рядківи проблеми. Значення за замовчуванням — 2.

# ProblemPatternSchema.column
source: The match group index of the problem's line character. Defaults to 3
uk: Індекс групи співставлення для символа в рядківе проблеми. Значення за замовчуванням — 3

# ProblemPatternSchema.endLine
source: The match group index of the problem's end line. Defaults to undefined
uk: Індекс групи співставлення для проблеми кінцевого рядка. За замовчуванням це невизначено.

# ProblemPatternSchema.endColumn
source: The match group index of the problem's end line character. Defaults to undefined
uk: Індекс групи співставлення для проблеми кінцевого символа. За замовчуванням це невизначено.

# ProblemPatternSchema.severity
source: The match group index of the problem's severity. Defaults to undefined
uk: Індекс групи співставлення для проблеми важливості. За замовчуванням це невизначено.

# ProblemPatternSchema.code
source: The match group index of the problem's code. Defaults to undefined
uk: Індекс групи співставлення для проблеми кода. За замовчуванням це невизначено.

# ProblemPatternSchema.message
source: The match group index of the message. If omitted it defaults to 4 if location is specified. Otherwise it defaults to 5.
uk: Індекс групи співставлення для повідомлення. Якщо він не вказаний, значення за замовчуванням — 4 при незаданому розташуванні. Інакше значення за замовчуванням — 5.

# ProblemPatternSchema.loop
source: In a multi line matcher loop indicated whether this pattern is executed in a loop as long as it matches. Can only specified on a last pattern in a multi line pattern.
uk: В циклі багаторядкового співставника вказує, чи виконується цей шаблон в циклі, пока він збігається. Може вказуватися лише для кінцевого шаблону в багаторядковому шаблоні.

# NamedProblemPatternSchema.name
source: The name of the problem pattern.
uk: Назва шаблону проблем.

# NamedMultiLineProblemPatternSchema.name
source: The name of the problem multi line problem pattern.
uk: Назва шаблону багаторядкових проблем.

# NamedMultiLineProblemPatternSchema.patterns
source: The actual patterns.
uk: Фактичні шаблони.

# ProblemPatternExtPoint
source: Contributes problem patterns
uk: Публіку шаблони проблем

# ProblemPatternRegistry.error
source: Invalid problem pattern. The pattern will be ignored.
uk: Неприпустимий шаблон проблем. Він буде пропущений.

# ProblemMatcherParser.noProblemMatcher
source: Error: the description can't be converted into a problem matcher: {0}
uk: Помилка: опис неможливо перетворити співставник проблем: {0}

# ProblemMatcherParser.noProblemPattern
source: Error: the description doesn't define a valid problem pattern: {0}
uk: Помилка: в описі не визначений допустимий шаблон проблеми: {0}

# ProblemMatcherParser.noOwner
source: Error: the description doesn't define an owner: {0}
uk: Помилка: в описі не визначений власник: {0}

# ProblemMatcherParser.noFileLocation
source: Error: the description doesn't define a file location: {0}
uk: Помилка: в описі не вказане розташування файла: {0}

# ProblemMatcherParser.unknownSeverity
source: Info: unknown severity {0}. Valid values are error, warning and info.
uk: Інформація: невідомий рівень важливості {0}. Допустимі значення: помилка, попередження і інформація.

# ProblemMatcherParser.noDefinedPatter
source: Error: the pattern with the identifier {0} doesn't exist.
uk: Помилка: шаблон з ідентифікатором {0} не існує.

# ProblemMatcherParser.noIdentifier
source: Error: the pattern property refers to an empty identifier.
uk: Помилка: властивість шаблону посилається на пустий індентифікатор.

# ProblemMatcherParser.noValidIdentifier
source: Error: the pattern property {0} is not a valid pattern variable name.
uk: Помилка: властивість шаблону {0} не є припустимим ім'ям зміної шаблону.

# ProblemMatcherParser.problemPattern.watchingMatcher
source: A problem matcher must define both a begin pattern and an end pattern for watching.
uk: У співставнику проблем повинні бути визначені як початковий, так і кінцевий шаблони для відстеження.

# ProblemMatcherParser.invalidRegexp
source: Error: The string {0} is not a valid regular expression.
uk: Помилка: рядок {0} не є припустимим регулярним виразом.

# WatchingPatternSchema.regexp
source: The regular expression to detect the begin or end of a background task.
uk: Регулярний вираз для виявлення початку або кінця фонової задачі.

# WatchingPatternSchema.file
source: The match group index of the filename. Can be omitted.
uk: Індекс групи співставлення для назви файла. Можливо знехтувати.

# PatternTypeSchema.name
source: The name of a contributed or predefined pattern
uk: Назва добавленого або зумовленого шаблону

# PatternTypeSchema.description
source: A problem pattern or the name of a contributed or predefined problem pattern. Can be omitted if base is specified.
uk: Шаблон проблем чи ім'я добавленого або зумовленого шаблону проблем. Ним можливо знехтувати, якщо вказано базове значення.

# ProblemMatcherSchema.base
source: The name of a base problem matcher to use.
uk: Назва використаного базового співставника проблем.

# ProblemMatcherSchema.owner
source: The owner of the problem inside Code. Can be omitted if base is specified. Defaults to 'external' if omitted and base is not specified.
uk: Власник проблеми в Code. Можливо знехтувати, якщо вказаний елемент base. Якщо власник пропущений, а елемент base не вказаний, значення за замовчуванням — "external".

# ProblemMatcherSchema.severity
source: The default severity for captures problems. Is used if the pattern doesn't define a match group for severity.
uk: Важливість за замовчуванням для виявлених проблем. Використовується, якщо в шаблоні не визначена група співставлення для важливості.

# ProblemMatcherSchema.applyTo
source: Controls if a problem reported on a text document is applied only to open, closed or all documents.
uk: Визначає, чи відноситься проблема, повідомленна для текстового документа, лише до відкритих, лише до закритих або до всіх документів.

# ProblemMatcherSchema.fileLocation
source: Defines how file names reported in a problem pattern should be interpreted.
uk: Визначає спосіб інтерпретації назв файлів, вказаних у шаблоні проблеми.

# ProblemMatcherSchema.background
source: Patterns to track the begin and end of a matcher active on a background task.
uk: Шаблони для відстеження початку і закінчення фонової задачі.

# ProblemMatcherSchema.background.activeOnStart
source: If set to true the background monitor is in active mode when the task starts. This is equals of issuing a line that matches the beginPattern
uk: Якщо задано значення true, моніторинг фонових задач буде находитися в активному режимі при запуску задачі. Це аналогічно видачі рядку, що відповідає шаблону початку.

# ProblemMatcherSchema.background.beginsPattern
source: If matched in the output the start of a background task is signaled.
uk: При збігові в вихідних даних подається сигнал про запуск фонової задачі.

# ProblemMatcherSchema.background.endsPattern
source: If matched in the output the end of a background task is signaled.
uk: При збігові в вихідних даних подається сигнал про завершення фонової задачі.

# ProblemMatcherSchema.watching.deprecated
source: The watching property is deprecated. Use background instead.
uk: Ця властивість для відстеження устаріла. Використовуйте колір фону.

# ProblemMatcherSchema.watching
source: Patterns to track the begin and end of a watching matcher.
uk: Шаблони для відстеження початку і закінчення шаблону відстеження.

# ProblemMatcherSchema.watching.activeOnStart
source: If set to true the watcher is in active mode when the task starts. This is equals of issuing a line that matches the beginPattern
uk: Якщо задано значення true, спостерігач находится в активному режимі, коли задача стартує. Це рівнозначно видачі рядку, що відповідає шаблону початку.

# ProblemMatcherSchema.watching.beginsPattern
source: If matched in the output the start of a watching task is signaled.
uk: При збігові в вихідних даних повідомляє про запуск задачі спостереження.

# ProblemMatcherSchema.watching.endsPattern
source: If matched in the output the end of a watching task is signaled.
uk: При збігові в вихідних даних повідомляє про завершення задачі спостереження.

# LegacyProblemMatcherSchema.watchedBegin.deprecated
source: This property is deprecated. Use the watching property instead.
uk: Ця властивість устаріла. Використовуйте властивість спостереження.

# LegacyProblemMatcherSchema.watchedBegin
source: A regular expression signaling that a watched tasks begins executing triggered through file watching.
uk: Регулярний вираз, повідомляє про те, що відстежувана задача починає виконуватися в результаті активації відстеження файлів.

# LegacyProblemMatcherSchema.watchedEnd.deprecated
source: This property is deprecated. Use the watching property instead.
uk: Ця властивість устаріла. Використовуйте властивість спостереження.

# LegacyProblemMatcherSchema.watchedEnd
source: A regular expression signaling that a watched tasks ends executing.
uk: Регулярний вираз, повідомляє про те, що відстежувана задача закінчує виконання.

# NamedProblemMatcherSchema.name
source: The name of the problem matcher used to refer to it.
uk: Назва співставника проблем, використаного для посилання.

# NamedProblemMatcherSchema.label
source: A human readable label of the problem matcher.
uk: Мітка співставника проблем в зручному для читання форматі.

# ProblemMatcherExtPoint
source: Contributes problem matchers
uk: Публікує співставники проблем

# msCompile
source: Microsoft compiler problems
uk: Проблеми компілятора Microsoft

# lessCompile
source: Less problems
uk: Приховати проблеми

# gulp-tsc
source: Gulp TSC Problems
uk: Проблеми TSC для Gulp

# jshint
source: JSHint problems
uk: Проблеми JSHint

# jshint-stylish
source: JSHint stylish problems
uk: Проблеми JSHint, пов'язані зі стилем

# eslint-compact
source: ESLint compact problems
uk: Проблеми ESLint, пов'язані з компактністю

# eslint-stylish
source: ESLint stylish problems
uk: Проблеми ESLint, пов'язані зі стилем

# go
source: Go problems
uk: Перейти до проблем

# contributes.jsonValidation
source: Contributes json schema configuration.
uk: Додає конфигурацію схеми JSON.

# contributes.jsonValidation.fileMatch
source: The file pattern to match, for example "package.json" or "*.launch".
uk: Шаблон файла для співставлення, наприклад "package.json" або "*.launch".

# contributes.jsonValidation.url
source: A schema URL ('http:', 'https:') or relative path to the extension folder ('./').
uk: URL-адрес схеми ("http:", "https:") або відносний шлях до папки додатку ("./").

# invalid.jsonValidation
source: 'configuration.jsonValidation' must be a array
uk: configuration.jsonValidation мусить бути масивом

# invalid.fileMatch
source: 'configuration.jsonValidation.fileMatch' must be defined
uk: Необхідно визначити configuration.jsonValidation.fileMatch

# invalid.url
source: 'configuration.jsonValidation.url' must be a URL or relative path
uk: Значення configuration.jsonValidation.url мусить бути URL-адресою або відносним шляхом

# invalid.url.fileschema
source: 'configuration.jsonValidation.url' is an invalid relative URL: {0}
uk: Значення configuration.jsonValidation.url є неприпустимиою відносною URL-адресою: {0}

# invalid.url.schema
source: 'configuration.jsonValidation.url' must start with 'http:', 'https:' or './' to reference schemas located in the extension
uk: Значення configuration.jsonValidation.url мусить починатися з "http:", "https:" або "./" для посилання на схеми, що містяться в додаткові

# contributes.color
source: Contributes extension defined themable colors
uk: Додає кольори тем, обумовлені додатком

# contributes.color.id
source: The identifier of the themable color
uk: Ідентифікатор кольору теми

# contributes.color.id.format
source: Identifiers should be in the form aa[.bb]*
uk: Ідентифікатори необхідно вказувати у формі aa[.bb]*

# contributes.color.description
source: The description of the themable color
uk: Опис кольору теми
